{"class_name": "Functional", "config": {"name": "autoencoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_32"}, "name": "input_32", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_264", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_264", "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_117", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_117", "inbound_nodes": [[["dense_264", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_265", "trainable": true, "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_265", "inbound_nodes": [[["dropout_117", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_266", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_266", "inbound_nodes": [[["dense_265", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_118", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_118", "inbound_nodes": [[["dense_266", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_267", "trainable": true, "dtype": "float32", "units": 40, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_267", "inbound_nodes": [[["dropout_118", 0, 0, {}]]]}], "input_layers": [["input_32", 0, 0]], "output_layers": [["dense_267", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}